;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                        Unix v18.12.2.LTS *
;* Date/Time created: Sun Sep 26 09:08:06 2021                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=32 --diag_wrap=off --embedded_constants=on --endian=big --float_support=VFPv3D16 --hll_source=on --object_format=elf --silicon_version=7R4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.state32

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../myuser_source/nn.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v18.12.2.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/mark/workspace_v9/dnn_llvm/Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("layer_index")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("layer_index")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/mark/ti/CMSIS/NN/Include/arm_nnfunctions.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1, DW_AT_decl_column(0x10)

	.global	layer_wt
	.sect	".data:layer_wt", RW
	.align	1
	.elfsym	layer_wt,SYM_SIZE(11216)
layer_wt:
	.bits		0xb,8

	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(3)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "TI", Tag_File, 1, Tag_FP_interface(0)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$128	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$128, DW_AT_byte_size(0x01)
$C$DW$139	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$139, DW_AT_name("ARM_MATH_SUCCESS")
	.dwattr $C$DW$139, DW_AT_const_value(0x00)
	.dwattr $C$DW$139, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$139, DW_AT_decl_column(0x07)

$C$DW$140	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$140, DW_AT_name("ARM_MATH_ARGUMENT_ERROR")
	.dwattr $C$DW$140, DW_AT_const_value(-1)
	.dwattr $C$DW$140, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$140, DW_AT_decl_column(0x07)

$C$DW$141	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$141, DW_AT_name("ARM_MATH_LENGTH_ERROR")
	.dwattr $C$DW$141, DW_AT_const_value(-2)
	.dwattr $C$DW$141, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$141, DW_AT_decl_column(0x07)

$C$DW$142	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$142, DW_AT_name("ARM_MATH_SIZE_MISMATCH")
	.dwattr $C$DW$142, DW_AT_const_value(-3)
	.dwattr $C$DW$142, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$142, DW_AT_decl_column(0x07)

$C$DW$143	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$143, DW_AT_name("ARM_MATH_NANINF")
	.dwattr $C$DW$143, DW_AT_const_value(-4)
	.dwattr $C$DW$143, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$143, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$143, DW_AT_decl_column(0x07)

$C$DW$144	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$144, DW_AT_name("ARM_MATH_SINGULAR")
	.dwattr $C$DW$144, DW_AT_const_value(-5)
	.dwattr $C$DW$144, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$144, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$144, DW_AT_decl_column(0x07)

$C$DW$145	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$145, DW_AT_name("ARM_MATH_TEST_FAILURE")
	.dwattr $C$DW$145, DW_AT_const_value(-6)
	.dwattr $C$DW$145, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x160)
	.dwattr $C$DW$145, DW_AT_decl_column(0x07)

	.dwattr $C$DW$T$128, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x159)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$128

$C$DW$T$136	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$136, DW_AT_name("arm_status")
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$136, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0x161)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x07)


$C$DW$T$139	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$139, DW_AT_byte_size(0x01)
$C$DW$146	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$146, DW_AT_name("ARM_SIGMOID")
	.dwattr $C$DW$146, DW_AT_const_value(0x00)
	.dwattr $C$DW$146, DW_AT_decl_file("/home/mark/ti/CMSIS/NN/Include/arm_nnsupportfunctions.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x43)
	.dwattr $C$DW$146, DW_AT_decl_column(0x05)

$C$DW$147	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$147, DW_AT_name("ARM_TANH")
	.dwattr $C$DW$147, DW_AT_const_value(0x01)
	.dwattr $C$DW$147, DW_AT_decl_file("/home/mark/ti/CMSIS/NN/Include/arm_nnsupportfunctions.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x45)
	.dwattr $C$DW$147, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$139, DW_AT_decl_file("/home/mark/ti/CMSIS/NN/Include/arm_nnsupportfunctions.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$139

$C$DW$T$140	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$140, DW_AT_name("arm_nn_activation_type")
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
	.dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$140, DW_AT_decl_file("/home/mark/ti/CMSIS/NN/Include/arm_nnsupportfunctions.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x03)


$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$148, DW_AT_name("__max_align1")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("/home/mark/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/include/sys/_types.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$148, DW_AT_decl_column(0x0c)

$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$149, DW_AT_name("__max_align2")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("/home/mark/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/include/sys/_types.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$149, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$21, DW_AT_decl_file("/home/mark/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$141	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$141, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$141, DW_AT_decl_file("/home/mark/ti/ccs910/ccs/tools/compiler/ti-cgt-arm_18.12.2.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x03)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$150, DW_AT_name("numTaps")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("numTaps")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x25c)
	.dwattr $C$DW$150, DW_AT_decl_column(0x0e)

$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$151, DW_AT_name("pState")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x25d)
	.dwattr $C$DW$151, DW_AT_decl_column(0x0b)

$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$152, DW_AT_name("pCoeffs")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x25e)
	.dwattr $C$DW$152, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$28, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$28

$C$DW$T$142	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$142, DW_AT_name("arm_fir_instance_q7")
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$142, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x25f)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x05)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x0c)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$153, DW_AT_name("numTaps")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("numTaps")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x266)
	.dwattr $C$DW$153, DW_AT_decl_column(0x0e)

$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$154, DW_AT_name("pState")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x267)
	.dwattr $C$DW$154, DW_AT_decl_column(0x0c)

$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$155, DW_AT_name("pCoeffs")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x268)
	.dwattr $C$DW$155, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$33, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x265)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$33

$C$DW$T$143	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$143, DW_AT_name("arm_fir_instance_q15")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$143, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x269)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x05)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$156, DW_AT_name("numTaps")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("numTaps")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x270)
	.dwattr $C$DW$156, DW_AT_decl_column(0x0e)

$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$157, DW_AT_name("pState")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x271)
	.dwattr $C$DW$157, DW_AT_decl_column(0x0c)

$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$158, DW_AT_name("pCoeffs")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x272)
	.dwattr $C$DW$158, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$38, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x26f)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$38

$C$DW$T$144	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$144, DW_AT_name("arm_fir_instance_q31")
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$144, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x273)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x05)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$159, DW_AT_name("numTaps")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("numTaps")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x27a)
	.dwattr $C$DW$159, DW_AT_decl_column(0x0e)

$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$160, DW_AT_name("pState")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x27b)
	.dwattr $C$DW$160, DW_AT_decl_column(0x10)

$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$161, DW_AT_name("pCoeffs")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x27c)
	.dwattr $C$DW$161, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$41, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x279)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$41

$C$DW$T$145	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$145, DW_AT_name("arm_fir_instance_f32")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x27d)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x05)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$162, DW_AT_name("numStages")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("numStages")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x31e)
	.dwattr $C$DW$162, DW_AT_decl_column(0x0c)

$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$163, DW_AT_name("pState")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x31f)
	.dwattr $C$DW$163, DW_AT_decl_column(0x0c)

$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$164, DW_AT_name("pCoeffs")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x320)
	.dwattr $C$DW$164, DW_AT_decl_column(0x0c)

$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$165, DW_AT_name("postShift")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("postShift")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x321)
	.dwattr $C$DW$165, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$42, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x31d)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$42

$C$DW$T$146	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$146, DW_AT_name("arm_biquad_casd_df1_inst_q15")
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$146, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x323)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x05)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$166, DW_AT_name("numStages")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("numStages")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x32b)
	.dwattr $C$DW$166, DW_AT_decl_column(0x0e)

$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$167, DW_AT_name("pState")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x32c)
	.dwattr $C$DW$167, DW_AT_decl_column(0x0c)

$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$168, DW_AT_name("pCoeffs")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x32d)
	.dwattr $C$DW$168, DW_AT_decl_column(0x0c)

$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$169, DW_AT_name("postShift")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("postShift")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x32e)
	.dwattr $C$DW$169, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$47, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x32a)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$47

$C$DW$T$147	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$147, DW_AT_name("arm_biquad_casd_df1_inst_q31")
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$147, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x330)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x05)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x0c)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$170, DW_AT_name("numStages")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("numStages")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x337)
	.dwattr $C$DW$170, DW_AT_decl_column(0x0e)

$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$171, DW_AT_name("pState")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x338)
	.dwattr $C$DW$171, DW_AT_decl_column(0x10)

$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$172, DW_AT_name("pCoeffs")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x339)
	.dwattr $C$DW$172, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$48, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x336)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$48

$C$DW$T$148	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$148, DW_AT_name("arm_biquad_casd_df1_inst_f32")
	.dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$148, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$148, DW_AT_decl_line(0x33c)
	.dwattr $C$DW$T$148, DW_AT_decl_column(0x05)


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$173, DW_AT_name("numRows")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x3c5)
	.dwattr $C$DW$173, DW_AT_decl_column(0x0e)

$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$174, DW_AT_name("numCols")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x3c6)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0e)

$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$175, DW_AT_name("pData")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x3c7)
	.dwattr $C$DW$175, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$49, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x3c4)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$49

$C$DW$T$149	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$149, DW_AT_name("arm_matrix_instance_f32")
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$149, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$149, DW_AT_decl_line(0x3c8)
	.dwattr $C$DW$T$149, DW_AT_decl_column(0x05)


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$176, DW_AT_name("numRows")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x3d0)
	.dwattr $C$DW$176, DW_AT_decl_column(0x0e)

$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$177, DW_AT_name("numCols")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x3d1)
	.dwattr $C$DW$177, DW_AT_decl_column(0x0e)

$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$178, DW_AT_name("pData")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x3d2)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$50, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x3cf)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$50

$C$DW$T$150	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$150, DW_AT_name("arm_matrix_instance_q15")
	.dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$150, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0x3d4)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x05)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$179, DW_AT_name("numRows")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x3dc)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0e)

$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$180, DW_AT_name("numCols")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x3dd)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0e)

$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$181, DW_AT_name("pData")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x3de)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$51, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x3db)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$51

$C$DW$T$151	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$151, DW_AT_name("arm_matrix_instance_q31")
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$151, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0x3e0)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x05)


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$182, DW_AT_name("A0")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("A0")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x538)
	.dwattr $C$DW$182, DW_AT_decl_column(0x0b)

$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$183, DW_AT_name("A1")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("A1")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x539)
	.dwattr $C$DW$183, DW_AT_decl_column(0x0b)

$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$184, DW_AT_name("state")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x53a)
	.dwattr $C$DW$184, DW_AT_decl_column(0x0b)

$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$185, DW_AT_name("Kp")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("Kp")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x53b)
	.dwattr $C$DW$185, DW_AT_decl_column(0x0b)

$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$186, DW_AT_name("Ki")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("Ki")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x53c)
	.dwattr $C$DW$186, DW_AT_decl_column(0x0b)

$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$187, DW_AT_name("Kd")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("Kd")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x53d)
	.dwattr $C$DW$187, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$53, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x537)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$53

$C$DW$T$152	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$152, DW_AT_name("arm_pid_instance_q15")
	.dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$152, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0x53e)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x05)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$188, DW_AT_name("A0")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("A0")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x545)
	.dwattr $C$DW$188, DW_AT_decl_column(0x0b)

$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$189, DW_AT_name("A1")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("A1")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x546)
	.dwattr $C$DW$189, DW_AT_decl_column(0x0b)

$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$190, DW_AT_name("A2")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("A2")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x547)
	.dwattr $C$DW$190, DW_AT_decl_column(0x0b)

$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$191, DW_AT_name("state")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x548)
	.dwattr $C$DW$191, DW_AT_decl_column(0x0b)

$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$192, DW_AT_name("Kp")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("Kp")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x549)
	.dwattr $C$DW$192, DW_AT_decl_column(0x0b)

$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$193, DW_AT_name("Ki")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("Ki")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x54a)
	.dwattr $C$DW$193, DW_AT_decl_column(0x0b)

$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$194, DW_AT_name("Kd")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("Kd")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x54b)
	.dwattr $C$DW$194, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$55, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x544)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$55

$C$DW$T$153	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$153, DW_AT_name("arm_pid_instance_q31")
	.dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$153, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$153, DW_AT_decl_line(0x54d)
	.dwattr $C$DW$T$153, DW_AT_decl_column(0x05)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x24)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$195, DW_AT_name("A0")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("A0")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x554)
	.dwattr $C$DW$195, DW_AT_decl_column(0x0f)

$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$196, DW_AT_name("A1")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("A1")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x555)
	.dwattr $C$DW$196, DW_AT_decl_column(0x0f)

$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$197, DW_AT_name("A2")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("A2")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x556)
	.dwattr $C$DW$197, DW_AT_decl_column(0x0f)

$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$198, DW_AT_name("state")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x557)
	.dwattr $C$DW$198, DW_AT_decl_column(0x0f)

$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$199, DW_AT_name("Kp")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("Kp")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x558)
	.dwattr $C$DW$199, DW_AT_decl_column(0x0f)

$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$200, DW_AT_name("Ki")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("Ki")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x559)
	.dwattr $C$DW$200, DW_AT_decl_column(0x0f)

$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$201, DW_AT_name("Kd")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("Kd")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x55a)
	.dwattr $C$DW$201, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$57, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x553)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$57

$C$DW$T$154	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$154, DW_AT_name("arm_pid_instance_f32")
	.dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$154, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$154, DW_AT_decl_line(0x55b)
	.dwattr $C$DW$T$154, DW_AT_decl_column(0x05)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$202, DW_AT_name("nValues")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("nValues")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x59e)
	.dwattr $C$DW$202, DW_AT_decl_column(0x0e)

$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$203, DW_AT_name("x1")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("x1")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x59f)
	.dwattr $C$DW$203, DW_AT_decl_column(0x0f)

$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$204, DW_AT_name("xSpacing")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("xSpacing")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x5a0)
	.dwattr $C$DW$204, DW_AT_decl_column(0x0f)

$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$205, DW_AT_name("pYData")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("pYData")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x5a1)
	.dwattr $C$DW$205, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$58, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x59d)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$58

$C$DW$T$155	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$155, DW_AT_name("arm_linear_interp_instance_f32")
	.dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$155, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$155, DW_AT_decl_line(0x5a2)
	.dwattr $C$DW$T$155, DW_AT_decl_column(0x05)


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x08)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$206, DW_AT_name("numRows")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x5aa)
	.dwattr $C$DW$206, DW_AT_decl_column(0x0e)

$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$207, DW_AT_name("numCols")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x5ab)
	.dwattr $C$DW$207, DW_AT_decl_column(0x0e)

$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$208, DW_AT_name("pData")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x5ac)
	.dwattr $C$DW$208, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$59, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x5a9)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$59

$C$DW$T$156	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$156, DW_AT_name("arm_bilinear_interp_instance_f32")
	.dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$156, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$156, DW_AT_decl_line(0x5ad)
	.dwattr $C$DW$T$156, DW_AT_decl_column(0x05)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x08)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$209, DW_AT_name("numRows")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x5b5)
	.dwattr $C$DW$209, DW_AT_decl_column(0x0e)

$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$210, DW_AT_name("numCols")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x5b6)
	.dwattr $C$DW$210, DW_AT_decl_column(0x0e)

$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$211, DW_AT_name("pData")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x5b7)
	.dwattr $C$DW$211, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$60, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x5b4)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$60

$C$DW$T$157	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$157, DW_AT_name("arm_bilinear_interp_instance_q31")
	.dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$157, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$157, DW_AT_decl_line(0x5b8)
	.dwattr $C$DW$T$157, DW_AT_decl_column(0x05)


$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$212, DW_AT_name("numRows")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x5c0)
	.dwattr $C$DW$212, DW_AT_decl_column(0x0e)

$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$213, DW_AT_name("numCols")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x5c1)
	.dwattr $C$DW$213, DW_AT_decl_column(0x0e)

$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$214, DW_AT_name("pData")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x5c2)
	.dwattr $C$DW$214, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$61, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x5bf)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$61

$C$DW$T$158	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$158, DW_AT_name("arm_bilinear_interp_instance_q15")
	.dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$158, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0x5c3)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x05)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x08)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$215, DW_AT_name("numRows")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("numRows")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x5cb)
	.dwattr $C$DW$215, DW_AT_decl_column(0x0e)

$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$216, DW_AT_name("numCols")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("numCols")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x5cc)
	.dwattr $C$DW$216, DW_AT_decl_column(0x0e)

$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$217, DW_AT_name("pData")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("pData")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x5cd)
	.dwattr $C$DW$217, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$62, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x5ca)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$62

$C$DW$T$159	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$159, DW_AT_name("arm_bilinear_interp_instance_q7")
	.dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$159, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$159, DW_AT_decl_line(0x5ce)
	.dwattr $C$DW$T$159, DW_AT_decl_column(0x05)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x10)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$218, DW_AT_name("fftLen")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("fftLen")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x614)
	.dwattr $C$DW$218, DW_AT_decl_column(0x0f)

$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$219, DW_AT_name("ifftFlag")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("ifftFlag")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x615)
	.dwattr $C$DW$219, DW_AT_decl_column(0x0f)

$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$220, DW_AT_name("bitReverseFlag")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("bitReverseFlag")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x616)
	.dwattr $C$DW$220, DW_AT_decl_column(0x0f)

$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$221, DW_AT_name("pTwiddle")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("pTwiddle")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x617)
	.dwattr $C$DW$221, DW_AT_decl_column(0x10)

$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$222, DW_AT_name("pBitRevTable")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("pBitRevTable")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x618)
	.dwattr $C$DW$222, DW_AT_decl_column(0x10)

$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$223, DW_AT_name("twidCoefModifier")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("twidCoefModifier")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x619)
	.dwattr $C$DW$223, DW_AT_decl_column(0x0f)

$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$224, DW_AT_name("bitRevFactor")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("bitRevFactor")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x61a)
	.dwattr $C$DW$224, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$64, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x613)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$64

$C$DW$T$67	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$67, DW_AT_name("arm_cfft_radix4_instance_q15")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$67, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x61b)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x05)

$C$DW$T$68	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x20)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$225, DW_AT_name("fftLen")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("fftLen")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x623)
	.dwattr $C$DW$225, DW_AT_decl_column(0x11)

$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$226, DW_AT_name("ifftFlag")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("ifftFlag")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x624)
	.dwattr $C$DW$226, DW_AT_decl_column(0x11)

$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$227, DW_AT_name("bitReverseFlag")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("bitReverseFlag")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x625)
	.dwattr $C$DW$227, DW_AT_decl_column(0x11)

$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$228, DW_AT_name("pTwiddle")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("pTwiddle")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x626)
	.dwattr $C$DW$228, DW_AT_decl_column(0x12)

$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$229, DW_AT_name("pBitRevTable")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("pBitRevTable")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x627)
	.dwattr $C$DW$229, DW_AT_decl_column(0x12)

$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$230, DW_AT_name("twidCoefModifier")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("twidCoefModifier")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x628)
	.dwattr $C$DW$230, DW_AT_decl_column(0x11)

$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$231, DW_AT_name("bitRevFactor")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("bitRevFactor")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x629)
	.dwattr $C$DW$231, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$65, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x622)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$65

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("arm_cfft_radix4_instance_q31")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x62a)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x05)

$C$DW$T$71	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$71, DW_AT_address_class(0x20)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x14)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$232, DW_AT_name("fftLen")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("fftLen")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x632)
	.dwattr $C$DW$232, DW_AT_decl_column(0x12)

$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$233, DW_AT_name("ifftFlag")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("ifftFlag")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x633)
	.dwattr $C$DW$233, DW_AT_decl_column(0x12)

$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$234, DW_AT_name("bitReverseFlag")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("bitReverseFlag")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x634)
	.dwattr $C$DW$234, DW_AT_decl_column(0x12)

$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$235, DW_AT_name("pTwiddle")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("pTwiddle")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x635)
	.dwattr $C$DW$235, DW_AT_decl_column(0x13)

$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$236, DW_AT_name("pBitRevTable")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("pBitRevTable")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x636)
	.dwattr $C$DW$236, DW_AT_decl_column(0x13)

$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$237, DW_AT_name("twidCoefModifier")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("twidCoefModifier")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x637)
	.dwattr $C$DW$237, DW_AT_decl_column(0x12)

$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$238, DW_AT_name("bitRevFactor")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("bitRevFactor")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x638)
	.dwattr $C$DW$238, DW_AT_decl_column(0x12)

$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$239, DW_AT_name("onebyfftLen")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("onebyfftLen")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x639)
	.dwattr $C$DW$239, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$66, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x631)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$66

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("arm_cfft_radix4_instance_f32")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x63a)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x05)

$C$DW$T$74	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$74, DW_AT_address_class(0x20)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x1c)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$240, DW_AT_name("fftLenReal")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("fftLenReal")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x79d)
	.dwattr $C$DW$240, DW_AT_decl_column(0x0e)

$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$241, DW_AT_name("fftLenBy2")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("fftLenBy2")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x79e)
	.dwattr $C$DW$241, DW_AT_decl_column(0x0e)

$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$242, DW_AT_name("ifftFlagR")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("ifftFlagR")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x79f)
	.dwattr $C$DW$242, DW_AT_decl_column(0x0e)

$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$243, DW_AT_name("bitReverseFlagR")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("bitReverseFlagR")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x7a0)
	.dwattr $C$DW$243, DW_AT_decl_column(0x0b)

$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$244, DW_AT_name("twidCoefRModifier")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("twidCoefRModifier")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x7a1)
	.dwattr $C$DW$244, DW_AT_decl_column(0x0e)

$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$245, DW_AT_name("pTwiddleAReal")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("pTwiddleAReal")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x7a2)
	.dwattr $C$DW$245, DW_AT_decl_column(0x0f)

$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$246, DW_AT_name("pTwiddleBReal")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("pTwiddleBReal")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x7a3)
	.dwattr $C$DW$246, DW_AT_decl_column(0x0f)

$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$247, DW_AT_name("pCfft")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("pCfft")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x7a4)
	.dwattr $C$DW$247, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$69, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x79c)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$69

$C$DW$T$82	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$82, DW_AT_name("arm_rfft_instance_q15")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$82, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x7a5)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x05)

$C$DW$T$83	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x20)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x1c)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$248, DW_AT_name("fftLenReal")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("fftLenReal")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x7ad)
	.dwattr $C$DW$248, DW_AT_decl_column(0x0e)

$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$249, DW_AT_name("fftLenBy2")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("fftLenBy2")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x7ae)
	.dwattr $C$DW$249, DW_AT_decl_column(0x0e)

$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$250, DW_AT_name("ifftFlagR")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("ifftFlagR")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x7af)
	.dwattr $C$DW$250, DW_AT_decl_column(0x0e)

$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$251, DW_AT_name("bitReverseFlagR")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("bitReverseFlagR")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x7b0)
	.dwattr $C$DW$251, DW_AT_decl_column(0x0b)

$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$252, DW_AT_name("twidCoefRModifier")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("twidCoefRModifier")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x7b1)
	.dwattr $C$DW$252, DW_AT_decl_column(0x0e)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$253, DW_AT_name("pTwiddleAReal")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("pTwiddleAReal")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x7b2)
	.dwattr $C$DW$253, DW_AT_decl_column(0x0f)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$254, DW_AT_name("pTwiddleBReal")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("pTwiddleBReal")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x7b3)
	.dwattr $C$DW$254, DW_AT_decl_column(0x0f)

$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$255, DW_AT_name("pCfft")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("pCfft")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0x7b4)
	.dwattr $C$DW$255, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$72, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x7ac)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$72

$C$DW$T$79	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$79, DW_AT_name("arm_rfft_instance_q31")
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$79, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x7b5)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x05)

$C$DW$T$80	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x18)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$256, DW_AT_name("fftLenReal")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("fftLenReal")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0x7bd)
	.dwattr $C$DW$256, DW_AT_decl_column(0x0f)

$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$257, DW_AT_name("fftLenBy2")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("fftLenBy2")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0x7be)
	.dwattr $C$DW$257, DW_AT_decl_column(0x0f)

$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$258, DW_AT_name("ifftFlagR")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("ifftFlagR")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0x7bf)
	.dwattr $C$DW$258, DW_AT_decl_column(0x0f)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$259, DW_AT_name("bitReverseFlagR")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("bitReverseFlagR")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x7c0)
	.dwattr $C$DW$259, DW_AT_decl_column(0x0f)

$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$260, DW_AT_name("twidCoefRModifier")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("twidCoefRModifier")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0x7c1)
	.dwattr $C$DW$260, DW_AT_decl_column(0x0c)

$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$261, DW_AT_name("pTwiddleAReal")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("pTwiddleAReal")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0x7c2)
	.dwattr $C$DW$261, DW_AT_decl_column(0x10)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$262, DW_AT_name("pTwiddleBReal")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("pTwiddleBReal")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x7c3)
	.dwattr $C$DW$262, DW_AT_decl_column(0x10)

$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$263, DW_AT_name("pCfft")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("pCfft")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0x7c4)
	.dwattr $C$DW$263, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$75, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x7bc)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$75

$C$DW$T$76	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$76, DW_AT_name("arm_rfft_instance_f32")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$76, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x7c5)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x05)

$C$DW$T$77	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$77, DW_AT_address_class(0x20)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x18)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$264, DW_AT_name("N")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0x827)
	.dwattr $C$DW$264, DW_AT_decl_column(0x0e)

$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$265, DW_AT_name("Nby2")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("Nby2")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x828)
	.dwattr $C$DW$265, DW_AT_decl_column(0x0e)

$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$266, DW_AT_name("normalize")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("normalize")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x829)
	.dwattr $C$DW$266, DW_AT_decl_column(0x0f)

$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$267, DW_AT_name("pTwiddle")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("pTwiddle")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x82a)
	.dwattr $C$DW$267, DW_AT_decl_column(0x10)

$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$268, DW_AT_name("pCosFactor")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("pCosFactor")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x82b)
	.dwattr $C$DW$268, DW_AT_decl_column(0x10)

$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$269, DW_AT_name("pRfft")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("pRfft")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x82c)
	.dwattr $C$DW$269, DW_AT_decl_column(0x1c)

$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$270, DW_AT_name("pCfft")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("pCfft")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x82d)
	.dwattr $C$DW$270, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$78, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x826)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$78

$C$DW$T$160	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$160, DW_AT_name("arm_dct4_instance_f32")
	.dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$160, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$160, DW_AT_decl_line(0x82e)
	.dwattr $C$DW$T$160, DW_AT_decl_column(0x05)


$C$DW$T$81	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x18)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$271, DW_AT_name("N")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x856)
	.dwattr $C$DW$271, DW_AT_decl_column(0x0e)

$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$272, DW_AT_name("Nby2")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("Nby2")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x857)
	.dwattr $C$DW$272, DW_AT_decl_column(0x0e)

$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$273, DW_AT_name("normalize")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("normalize")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x858)
	.dwattr $C$DW$273, DW_AT_decl_column(0x0b)

$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$274, DW_AT_name("pTwiddle")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("pTwiddle")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x859)
	.dwattr $C$DW$274, DW_AT_decl_column(0x0c)

$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$275, DW_AT_name("pCosFactor")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("pCosFactor")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x85a)
	.dwattr $C$DW$275, DW_AT_decl_column(0x0c)

$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$276, DW_AT_name("pRfft")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("pRfft")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x85b)
	.dwattr $C$DW$276, DW_AT_decl_column(0x1c)

$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$277, DW_AT_name("pCfft")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("pCfft")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x85c)
	.dwattr $C$DW$277, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$81, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$81, DW_AT_decl_line(0x855)
	.dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$81

$C$DW$T$161	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$161, DW_AT_name("arm_dct4_instance_q31")
	.dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$161, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$161, DW_AT_decl_line(0x85d)
	.dwattr $C$DW$T$161, DW_AT_decl_column(0x05)


$C$DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x18)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$278, DW_AT_name("N")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("N")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x885)
	.dwattr $C$DW$278, DW_AT_decl_column(0x0e)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$279, DW_AT_name("Nby2")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("Nby2")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x886)
	.dwattr $C$DW$279, DW_AT_decl_column(0x0e)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$280, DW_AT_name("normalize")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("normalize")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x887)
	.dwattr $C$DW$280, DW_AT_decl_column(0x0b)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$281, DW_AT_name("pTwiddle")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("pTwiddle")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x888)
	.dwattr $C$DW$281, DW_AT_decl_column(0x0c)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$282, DW_AT_name("pCosFactor")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("pCosFactor")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x889)
	.dwattr $C$DW$282, DW_AT_decl_column(0x0c)

$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$283, DW_AT_name("pRfft")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("pRfft")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x88a)
	.dwattr $C$DW$283, DW_AT_decl_column(0x1c)

$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$284, DW_AT_name("pCfft")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("pCfft")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x88b)
	.dwattr $C$DW$284, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$84, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x884)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$84

$C$DW$T$162	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$162, DW_AT_name("arm_dct4_instance_q15")
	.dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$162, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$162, DW_AT_decl_line(0x88c)
	.dwattr $C$DW$T$162, DW_AT_decl_column(0x05)


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x0c)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$285, DW_AT_name("M")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("M")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0xbd9)
	.dwattr $C$DW$285, DW_AT_decl_column(0x0d)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$286, DW_AT_name("numTaps")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("numTaps")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0xbda)
	.dwattr $C$DW$286, DW_AT_decl_column(0x0e)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$287, DW_AT_name("pCoeffs")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0xbdb)
	.dwattr $C$DW$287, DW_AT_decl_column(0x0c)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$288, DW_AT_name("pState")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0xbdc)
	.dwattr $C$DW$288, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$85, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0xbd8)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$85

$C$DW$T$163	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$163, DW_AT_name("arm_fir_decimate_instance_q15")
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$163, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$163, DW_AT_decl_line(0xbdd)
	.dwattr $C$DW$T$163, DW_AT_decl_column(0x05)


$C$DW$T$86	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x0c)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$289, DW_AT_name("M")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("M")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0xbe5)
	.dwattr $C$DW$289, DW_AT_decl_column(0x0d)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$290, DW_AT_name("numTaps")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("numTaps")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0xbe6)
	.dwattr $C$DW$290, DW_AT_decl_column(0x0e)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$291, DW_AT_name("pCoeffs")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("pCoeffs")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0xbe7)
	.dwattr $C$DW$291, DW_AT_decl_column(0x0c)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$292, DW_AT_name("pState")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("pState")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0xbe8)
	.dwattr $C$DW$292, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$86, DW_AT_decl_file("/home/mark/ti/Cortex-R4 CMSIS DSP Library/1.0.0/Include/arm_math.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0xbe4)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$86

$C$DW$T$164	.dwtag  DW_TAG_typedef
